robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/*
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== Board_init.c ========
 *  This file is responsible for setting up the board specific items for the
 *  MSP_EXP432E401Y board.
 */
#include <stdint.h>
#include <stdlib.h>

#ifndef __MSP432E401Y__
#define __MSP432E401Y__
#endif

#include <ti/devices/msp432e4/inc/msp432.h>

#include <ti/devices/msp432e4/driverlib/adc.h>
#include <ti/devices/msp432e4/driverlib/interrupt.h>
#include <ti/devices/msp432e4/driverlib/pwm.h>
#include <ti/devices/msp432e4/driverlib/sysctl.h>
#include <ti/devices/msp432e4/driverlib/udma.h>

#include <ti/devices/msp432e4/driverlib/rom.h>
#include <ti/devices/msp432e4/driverlib/rom_map.h>
#include <ti/devices/msp432e4/driverlib/gpio.h>
#include <ti/devices/msp432e4/driverlib/sysctl.h>

#include <ti/drivers/Power.h>

#include "MSP_EXP432E401Y.h"

/*
 *  =============================== ADC ===============================
 */
#include <ti/drivers/ADC.h>
#include <ti/drivers/adc/ADCMSP432E4.h>

extern ADC_Handle ADCMSP432E4_open(ADC_Handle handle, ADC_Params *params);
extern void ADCMSP432E4_close(ADC_Handle handle);
extern void ADCMSP432E4_init(ADC_Handle handle);
extern int_fast16_t ADCMSP432E4_convert(ADC_Handle handle, uint16_t *value);

/* ADC function table for ADCMSP432 implementation */
const ADC_FxnTable myADCMSP432E4_fxnTable = {
    ADCMSP432E4_close,
    NULL, /* ADCMSP432_control, */
    ADCMSP432E4_convert,
    NULL, /* ADCMSP432_convertRawToMicroVolts, */
    ADCMSP432E4_init,
    ADCMSP432E4_open
};

/* ADC objects */
ADCMSP432E4_Object adcMSP432E4Objects[20];

/* ADC configuration structure */
ADCMSP432E4_HWAttrsV1 adcMSP432E4HWAttrs[20] = {
    {
        .adcPin = ADCMSP432E4_PE_3_A0,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PE_2_A1,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PE_1_A2,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PE_0_A3,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_7_A4,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_6_A5,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_5_A6,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_4_A7,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PE_5_A8,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PE_4_A9,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PB_4_A10,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PB_5_A11,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_3_A12,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_2_A13,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_1_A14,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PD_0_A15,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PK_0_A16,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PK_1_A17,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PK_2_A18,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    },
    {
        .adcPin = ADCMSP432E4_PK_3_A19,
        .refVoltage = ADCMSP432E4_VREF_INTERNAL,
        .adcModule = ADCMSP432E4_MOD0,
        .adcSeq = ADCMSP432E4_SEQ0
    }
};

const ADC_Config ADC_config[20] = {
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[0],
        .hwAttrs = &adcMSP432E4HWAttrs[0]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[1],
        .hwAttrs = &adcMSP432E4HWAttrs[1]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[2],
        .hwAttrs = &adcMSP432E4HWAttrs[2]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[3],
        .hwAttrs = &adcMSP432E4HWAttrs[3]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[4],
        .hwAttrs = &adcMSP432E4HWAttrs[4]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[5],
        .hwAttrs = &adcMSP432E4HWAttrs[5]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[6],
        .hwAttrs = &adcMSP432E4HWAttrs[6]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[7],
        .hwAttrs = &adcMSP432E4HWAttrs[7]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[8],
        .hwAttrs = &adcMSP432E4HWAttrs[8]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[9],
        .hwAttrs = &adcMSP432E4HWAttrs[9]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[10],
        .hwAttrs = &adcMSP432E4HWAttrs[10]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[11],
        .hwAttrs = &adcMSP432E4HWAttrs[11]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[12],
        .hwAttrs = &adcMSP432E4HWAttrs[12]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[13],
        .hwAttrs = &adcMSP432E4HWAttrs[13]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[14],
        .hwAttrs = &adcMSP432E4HWAttrs[14]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[15],
        .hwAttrs = &adcMSP432E4HWAttrs[15]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[16],
        .hwAttrs = &adcMSP432E4HWAttrs[16]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[17],
        .hwAttrs = &adcMSP432E4HWAttrs[17]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[18],
        .hwAttrs = &adcMSP432E4HWAttrs[18]
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = &adcMSP432E4Objects[19],
        .hwAttrs = &adcMSP432E4HWAttrs[19]
    }
};

const uint_least8_t ADC_count = 20;

