robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
    /* pins 51-60 */
    GPIOMSP432E4_PM6 | GPIO_DO_NOT_CONFIG,          /*  51 - PM6 */
    GPIOMSP432E4_PQ1 | GPIO_DO_NOT_CONFIG,          /*  52 - PQ1 */
    GPIOMSP432E4_PP3 | GPIO_DO_NOT_CONFIG,          /*  53 - PP3 */
    GPIOMSP432E4_PQ3 | GPIO_DO_NOT_CONFIG,          /*  54 - PQ3 */
    GPIOMSP432E4_PQ2 | GPIO_DO_NOT_CONFIG,          /*  55 - PQ2 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  56 - RESET */
    GPIOMSP432E4_PA7 | GPIO_DO_NOT_CONFIG,          /*  57 - PA7 */
    GPIOMSP432E4_PP5 | GPIO_DO_NOT_CONFIG,          /*  58 - PP5 */
    GPIOMSP432E4_PM7 | GPIO_DO_NOT_CONFIG,          /*  59 - PM7 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  60 - GND */

    /* pins 61-70 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  61 - 5V */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  62 - GND */
    GPIOMSP432E4_PB4 | GPIO_DO_NOT_CONFIG,          /*  63 - PB4 */
    GPIOMSP432E4_PB5 | GPIO_DO_NOT_CONFIG,          /*  64 - PB5 */
    GPIOMSP432E4_PK0 | GPIO_DO_NOT_CONFIG,          /*  65 - PK0 */
    GPIOMSP432E4_PK1 | GPIO_DO_NOT_CONFIG,          /*  66 - PK1 */
    GPIOMSP432E4_PK2 | GPIO_DO_NOT_CONFIG,          /*  67 - PK2 */
    GPIOMSP432E4_PK3 | GPIO_DO_NOT_CONFIG,          /*  68 - PK3 */
    GPIOMSP432E4_PA4 | GPIO_DO_NOT_CONFIG,          /*  69 - PA4 */
    GPIOMSP432E4_PA5 | GPIO_DO_NOT_CONFIG,          /*  70 - PA5 */

    /* pins 71-80 */
    GPIOMSP432E4_PK7 | GPIO_DO_NOT_CONFIG,          /*  71 - PK7 */
    GPIOMSP432E4_PK6 | GPIO_DO_NOT_CONFIG,          /*  72 - PK6 */
    GPIOMSP432E4_PH1 | GPIO_DO_NOT_CONFIG,          /*  73 - PH1 */
    GPIOMSP432E4_PH0 | GPIO_DO_NOT_CONFIG,          /*  74 - PH0 */
    GPIOMSP432E4_PM2 | GPIO_DO_NOT_CONFIG,          /*  75 - PM2 */
    GPIOMSP432E4_PM1 | GPIO_DO_NOT_CONFIG,          /*  76 - PM1 */
    GPIOMSP432E4_PM0 | GPIO_DO_NOT_CONFIG,          /*  77 - PM0 */
    GPIOMSP432E4_PK5 | GPIO_DO_NOT_CONFIG,          /*  78 - PK5 */
    GPIOMSP432E4_PK4 | GPIO_DO_NOT_CONFIG,          /*  79 - PK4 */
    GPIOMSP432E4_PG1 | GPIO_DO_NOT_CONFIG,          /*  80 - PG1 */

    /* virtual pins 81-95 */
    GPIOMSP432E4_PN1 | GPIO_DO_NOT_CONFIG,          /*  81 - PN1 D1 */
    GPIOMSP432E4_PN0 | GPIO_DO_NOT_CONFIG,          /*  82 - PN0 D2 */
    GPIOMSP432E4_PF4 | GPIO_DO_NOT_CONFIG,          /*  83 - PF4 D3 */
    GPIOMSP432E4_PF0 | GPIO_DO_NOT_CONFIG,          /*  84 - PF0 D4 */
    GPIOMSP432E4_PJ0 | GPIO_DO_NOT_CONFIG,          /*  85 - PJ0 SW1 */
    GPIOMSP432E4_PJ1 | GPIO_DO_NOT_CONFIG,          /*  86 - PJ1 SW2 */
    GPIOMSP432E4_PD6 | GPIO_DO_NOT_CONFIG,          /*  87 - PD6 A5 */
    GPIOMSP432E4_PA0 | GPIO_DO_NOT_CONFIG,          /*  88 - PA0 JP4 */
    GPIOMSP432E4_PA1 | GPIO_DO_NOT_CONFIG,          /*  89 - PA1 JP5 */
    GPIOMSP432E4_PA2 | GPIO_DO_NOT_CONFIG,          /*  90 - PA2 */
    GPIOMSP432E4_PA3 | GPIO_DO_NOT_CONFIG,          /*  91 - PA3 */
    GPIOMSP432E4_PL6 | GPIO_DO_NOT_CONFIG,          /*  92 - PL6 */
    GPIOMSP432E4_PL7 | GPIO_DO_NOT_CONFIG,          /*  93 - PL7 */
    GPIOMSP432E4_PB0 | GPIO_DO_NOT_CONFIG,          /*  94 - PB0 */
    GPIOMSP432E4_PB1 | GPIO_DO_NOT_CONFIG,          /*  95 - PB1 */
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432E401Y.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    /* port_pin */
    NULL,  /*  0  - dummy */

    /* pins 1-10 */
    NULL,  /*  1  - 3.3V */
    NULL,  /*  2  - PE4 */
    NULL,  /*  3  - PC4 */
    NULL,  /*  4  - PC5 */
    NULL,  /*  5  - PC6 */
    NULL,  /*  6  - PE5 */
    NULL,  /*  7  - PD3 */
    NULL,  /*  8  - PC7 */
    NULL,  /*  9  - PB2 */
    NULL,  /*  10 - PB3 */

    /* pins 11-20 */
    NULL,  /*  11 - PP2 */
    NULL,  /*  12 - PN3 */
    NULL,  /*  13 - PN2 */
    NULL,  /*  14 - PD0 */
    NULL,  /*  15 - PD1 */
    NULL,  /*  16 - RESET */
    NULL,  /*  17 - PH3 */
    NULL,  /*  18 - PH2 */
    NULL,  /*  19 - PM3 */
    NULL,  /*  20 - GND */

    /* pins 21-30 */
    NULL,  /*  21 - 5V */
    NULL,  /*  22 - GND */
    NULL,  /*  23 - PE0 */
    NULL,  /*  24 - PE1 */
    NULL,  /*  25 - PE2 */
    NULL,  /*  26 - PE3 */
    NULL,  /*  27 - PD7 NMI */
    NULL,  /*  28 - PD6 */
    NULL,  /*  29 - PM4 */
    NULL,  /*  30 - PM5 */

    /* pins 31-40 */
    NULL,  /*  31 - PL3 */
    NULL,  /*  32 - PL2 */
    NULL,  /*  33 - PL1 */
    NULL,  /*  34 - PL0 */
    NULL,  /*  35 - PL5 */
    NULL,  /*  36 - PL4 */
    NULL,  /*  37 - PG0 */
    NULL,  /*  38 - PF3 */
    NULL,  /*  39 - PF2 */
    NULL,  /*  40 - PF1 */

    /* pins 41-50 */
    NULL,  /*  41  - 3.3V */
    NULL,  /*  42 - PD2 */
    NULL,  /*  43 - PP0 */
    NULL,  /*  44 - PP1 */
    NULL,  /*  45 - PD4 */
    NULL,  /*  46 - PD5 */
    NULL,  /*  47 - PQ0 */
    NULL,  /*  48 - PP4 */
    NULL,  /*  49 - PN5 */
    NULL,  /*  50 - PN4 */

    /* pins 51-60 */
    NULL,  /*  51 - PM6 */
    NULL,  /*  52 - PQ1 */
    NULL,  /*  53 - PP3 */
    NULL,  /*  54 - PQ3 */
    NULL,  /*  55 - PQ2 */
    NULL,  /*  56 - RESET */
    NULL,  /*  57 - PA7 */
    NULL,  /*  58 - PP5 */
    NULL,  /*  59 - PM7 */
    NULL,  /*  60 - GND */

    /* pins 61-70 */
    NULL,  /*  61 - 5V */
    NULL,  /*  62 - GND */
    NULL,  /*  63 - PB4 */
    NULL,  /*  64 - PB5 */
    NULL,  /*  65 - PK0 */
    NULL,  /*  66 - PK1 */
    NULL,  /*  67 - PK2 */
    NULL,  /*  68 - PK3 */
    NULL,  /*  69 - PA4 */
    NULL,  /*  70 - PA5 */

    /* pins 71-80 */
    NULL,  /*  71 - PK7 */
    NULL,  /*  72 - PK6 */
    NULL,  /*  73 - PH1 */
    NULL,  /*  74 - PH0 */
    NULL,  /*  75 - PM2 */
    NULL,  /*  76 - PM1 */
    NULL,  /*  77 - PM0 */
    NULL,  /*  78 - PK5 */
    NULL,  /*  79 - PK4 */
    NULL,  /*  80 - PG1 */
    
    /* virtual pins 81-95 */
    NULL,  /*  81 - PN1 D1 */
    NULL,  /*  82 - PN0 D2 */
    NULL,  /*  83 - PF4 D3 */
    NULL,  /*  84 - PF0 D4 */
    NULL,  /*  85 - PJ0 SW1 */
    NULL,  /*  86 - PJ1 SW2 */
    NULL,  /*  87 - PD6 A5 */
    NULL,  /*  88 - PA0 JP4 */
    NULL,  /*  89 - PA1 JP5 */
    NULL,  /*  90 - PA2 */
    NULL,  /*  91 - PA3 */
    NULL,  /*  92 - PL6 */
    NULL,  /*  93 - PL7 */
    NULL,  /*  94 - PB0 */
    NULL,  /*  95 - PB1 */
};

