robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/* The device-specific GPIO_config structure */
const GPIOMSP432E4_Config GPIOMSP432E4_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  =============================== I2C ===============================
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CMSP432E4.h>

#define Board_I2CCOUNT 5

I2CMSP432E4_Object i2cMSP432E4Objects[Board_I2CCOUNT];

const I2CMSP432E4_HWAttrs i2cMSP432E4HWAttrs[Board_I2CCOUNT] = {
    /* Wire */
    {
        .baseAddr = I2C0_BASE,
        .intNum = INT_I2C0,
        .intPriority = (~0),
        .sclPin  = I2CMSP432E4_PB2_I2C0SCL,
        .sdaPin = I2CMSP432E4_PB3_I2C0SDA
    },
    /* Wire1 */
    {
        .baseAddr = I2C2_BASE,
        .intNum = INT_I2C2,
        .intPriority = (~0),
        .sclPin  = I2CMSP432E4_PN5_I2C2SCL,
        .sdaPin = I2CMSP432E4_PN4_I2C2SDA
    },
    /* Wire2 */
    {
        .baseAddr = I2C7_BASE,
        .intNum = INT_I2C7,
        .intPriority = (~0),
        .sclPin  = I2CMSP432E4_PD0_I2C7SCL,
        .sdaPin = I2CMSP432E4_PD1_I2C7SDA
    },
    /* Wire3 */
    {
        .baseAddr = I2C8_BASE,
        .intNum = INT_I2C8,
        .intPriority = (~0),
        .sclPin  = I2CMSP432E4_PA2_I2C8SCL,
        .sdaPin = I2CMSP432E4_PA3_I2C8SDA
    },
    /* Wire4 */
    {
        .baseAddr = I2C2_BASE,
        .intNum = INT_I2C2,
        .intPriority = (~0),
        .sclPin  = I2CMSP432E4_PL1_I2C2SCL,
        .sdaPin = I2CMSP432E4_PL0_I2C2SDA
    }
};

/*
 *  ======== I2C_config ========
 */
const I2C_Config I2C_config[Board_I2CCOUNT] = {
    /* Wire */
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[0],
        .hwAttrs = &i2cMSP432E4HWAttrs[0]
    },
    /* Wire1 */
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[1],
        .hwAttrs = &i2cMSP432E4HWAttrs[1]
    },
    /* Wire2 */
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[2],
        .hwAttrs = &i2cMSP432E4HWAttrs[2]
    },
    /* Wire3 */
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[3],
        .hwAttrs = &i2cMSP432E4HWAttrs[3]
    },
    /* Wire4 */
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[4],
        .hwAttrs = &i2cMSP432E4HWAttrs[4]
    }
};

const uint_least8_t I2C_count = Board_I2CCOUNT;

/*
 *  =============================== NVS ===============================
 *  Non-Volatile Storage configuration.
 */
#include <ti/drivers/NVS.h>
#include <ti/drivers/nvs/NVSMSP432E4.h>


NVSMSP432E4_Object nvsMSP432E4Objects[1];

extern uint8_t __NVS_BASE__;
extern uint8_t __NVS_SIZE__;

const NVSMSP432E4_HWAttrs nvsMSP432E4HWAttrs[] = {
    {
        .regionBase = (void *)&__NVS_BASE__,   /* base of unused flash aligned on 4k boundary */
        .regionSize = (size_t)(&__NVS_SIZE__) 
    },
};

const NVS_Config NVS_config[] = {
    {
        .fxnTablePtr = &NVSMSP432E4_fxnTable,
        .object = &nvsMSP432E4Objects[0],
        .hwAttrs = &nvsMSP432E4HWAttrs[0],
    },
};

const uint_least8_t NVS_count = MSP_EXP432E401Y_NVSCOUNT;

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/power/PowerMSP432E4.h>
const PowerMSP432E4_Config PowerMSP432E4_config = {
    .policyFxn = &PowerMSP432E4_sleepPolicy,
    .enablePolicy = true
};

/*
 *  =============================== PWM ===============================
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMMSP432E4.h>

PWMMSP432E4_Object pwmMSP432E4Objects[MSP_EXP432E401Y_PWMCOUNT];

const PWMMSP432E4_HWAttrs pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWMCOUNT] = {
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_0,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PF0_M0PWM0
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_1,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PF1_M0PWM1
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_2,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PF2_M0PWM2
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_3,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PF3_M0PWM3
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_4,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PG0_M0PWM4
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_5,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PG1_M0PWM5
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_6,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PK4_M0PWM6
    },
    {
        .pwmBaseAddr = PWM0_BASE,
        .pwmOutput = PWM_OUT_7,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN,
        .pinConfig = PWMMSP432E4_PK5_M0PWM7
    }
};

const PWM_Config PWM_config[MSP_EXP432E401Y_PWMCOUNT] = {
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM0],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM0]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM1],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM1]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM2],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM2]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM3],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM3]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM4],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM4]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM5],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM5]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM6],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM6]
    },
    {
        .fxnTablePtr = &PWMMSP432E4_fxnTable,
        .object = &pwmMSP432E4Objects[MSP_EXP432E401Y_PWM7],
        .hwAttrs = &pwmMSP432E4HWAttrs[MSP_EXP432E401Y_PWM7]
    }
};

const uint_least8_t PWM_count = MSP_EXP432E401Y_PWMCOUNT;

