robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/*
 *  =============================== SDFatFS ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/SDFatFS.h>

/*
 * Note: The SDFatFS driver provides interface functions to enable FatFs
 * but relies on the SD driver to communicate with SD cards.  Opening a
 * SDFatFs driver instance will internally try to open a SD driver instance
 * reusing the same index number (opening SDFatFs driver at index 0 will try to
 * open SD driver at index 0).  This requires that all SDFatFs driver instances
 * have an accompanying SD driver instance defined with the same index.  It is
 * acceptable to have more SD driver instances than SDFatFs driver instances
 * but the opposite is not supported & the SDFatFs will fail to open.
 */
SDFatFS_Object sdfatfsObjects[MSP_EXP432E401Y_SDFatFSCOUNT];

const SDFatFS_Config SDFatFS_config[MSP_EXP432E401Y_SDFatFSCOUNT] = {
    {
        .object = &sdfatfsObjects[MSP_EXP432E401Y_SDFatFS0]
    }
};

const uint_least8_t SDFatFS_count = MSP_EXP432E401Y_SDFatFSCOUNT;

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[MSP_EXP432E401Y_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[MSP_EXP432E401Y_SDCOUNT] = {
    {
        .spiIndex = MSP_EXP432E401Y_SPI2,
        .spiCsGpioIndex = MSP_EXP432E401Y_SDSPI_CS
    }
};

const SD_Config SD_config[MSP_EXP432E401Y_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[MSP_EXP432E401Y_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[MSP_EXP432E401Y_SDSPI0]
    },
};

const uint_least8_t SD_count = MSP_EXP432E401Y_SDCOUNT;

/*
 *  =============================== SPI ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPIMSP432E4DMA.h>

SPIMSP432E4DMA_Object spiMSP432E4DMAObjects[MSP_EXP432E401Y_SPICOUNT];

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(spiMSP432E4DMAscratchBuf, 32)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=32
#elif defined(__GNUC__)
__attribute__ ((aligned (32)))
#endif
uint16_t spiMSP432E4DMAscratchBuf[MSP_EXP432E401Y_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPIMSP432E4DMA_HWAttrs spiMSP432E4DMAHWAttrs[MSP_EXP432E401Y_SPICOUNT] = {
    /* SPI */
    {
        .baseAddr = SSI2_BASE,
        .intNum = INT_SSI2,
        .intPriority = (~0),
        .scratchBufPtr = &spiMSP432E4DMAscratchBuf[MSP_EXP432E401Y_SPI2],
        .defaultTxBufValue = 0xFF,
        .rxDmaChannel = UDMA_CH12_SSI2RX,
        .txDmaChannel = UDMA_CH13_SSI2TX,
        .minDmaTransferSize = 10,
        .clkPinMask = SPIMSP432E4_PD3_SSI2CLK,
        .fssPinMask = SPIMSP432E4_PD2_SSI2FSS,
        .xdat0PinMask = SPIMSP432E4_PD1_SSI2XDAT0,
        .xdat1PinMask = SPIMSP432E4_PD0_SSI2XDAT1
    },
    /* SPI1 */
    {
        .baseAddr = SSI3_BASE,
        .intNum = INT_SSI3,
        .intPriority = (~0),
        .scratchBufPtr = &spiMSP432E4DMAscratchBuf[MSP_EXP432E401Y_SPI3],
        .defaultTxBufValue = 0xFF,
        .minDmaTransferSize = 10,
        .rxDmaChannel = UDMA_CH14_SSI3RX,
        .txDmaChannel = UDMA_CH15_SSI3TX,
        .clkPinMask = SPIMSP432E4_PQ0_SSI3CLK,
        .fssPinMask = SPIMSP432E4_PQ1_SSI3FSS,
        .xdat0PinMask = SPIMSP432E4_PQ2_SSI3XDAT0,
        .xdat1PinMask = SPIMSP432E4_PQ3_SSI3XDAT1
    }
};

const SPI_Config SPI_config[MSP_EXP432E401Y_SPICOUNT] = {
    {
        .fxnTablePtr = &SPIMSP432E4DMA_fxnTable,
        .object = &spiMSP432E4DMAObjects[MSP_EXP432E401Y_SPI2],
        .hwAttrs = &spiMSP432E4DMAHWAttrs[MSP_EXP432E401Y_SPI2]
    },
    {
        .fxnTablePtr = &SPIMSP432E4DMA_fxnTable,
        .object = &spiMSP432E4DMAObjects[MSP_EXP432E401Y_SPI3],
        .hwAttrs = &spiMSP432E4DMAHWAttrs[MSP_EXP432E401Y_SPI3]
    },
};

const uint_least8_t SPI_count = MSP_EXP432E401Y_SPICOUNT;

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTMSP432E4.h>

#define Board_UARTCOUNT 5

static unsigned char uartMSP432E4RingBuffer0[32];
UARTMSP432E4_Object uartMSP432E4Objects0;

/* Serial */
static const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs0 = {
    .baseAddr           = UART0_BASE,
    .intNum             = INT_UART0,
    .intPriority        = (~0),
    .flowControl        = UARTMSP432E4_FLOWCTRL_NONE,
    .ringBufPtr         = uartMSP432E4RingBuffer0,
    .ringBufSize        = sizeof(uartMSP432E4RingBuffer0),
    .rxPin              = UARTMSP432E4_PA0_U0RX,
    .txPin              = UARTMSP432E4_PA1_U0TX,
    .ctsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .rtsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .errorFxn           = NULL
};

static unsigned char uartMSP432E4RingBuffer1[32];
UARTMSP432E4_Object uartMSP432E4Objects1;

/* Serial1 */
static const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs1 = {
    .baseAddr           = UART7_BASE,
    .intNum             = INT_UART7,
    .intPriority        = (~0),
    .flowControl        = UARTMSP432E4_FLOWCTRL_NONE,
    .ringBufPtr         = uartMSP432E4RingBuffer1,
    .ringBufSize        = sizeof(uartMSP432E4RingBuffer1),
    .rxPin              = UARTMSP432E4_PC4_U7RX,
    .txPin              = UARTMSP432E4_PC5_U7TX,
    .ctsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .rtsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .errorFxn           = NULL
};

static unsigned char uartMSP432E4RingBuffer2[32];
UARTMSP432E4_Object uartMSP432E4Objects2;

/* Serial2 */
static const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs2 = {
    .baseAddr           = UART6_BASE,
    .intNum             = INT_UART6,
    .intPriority        = (~0),
    .flowControl        = UARTMSP432E4_FLOWCTRL_NONE,
    .ringBufPtr         = uartMSP432E4RingBuffer2,
    .ringBufSize        = sizeof(uartMSP432E4RingBuffer2),
    .rxPin              = UARTMSP432E4_PP0_U6RX,
    .txPin              = UARTMSP432E4_PP1_U6TX,
    .ctsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .rtsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .errorFxn           = NULL
};

static unsigned char uartMSP432E4RingBuffer3[32];
UARTMSP432E4_Object uartMSP432E4Objects3;

/* Serial3 */
static const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs3 = {
    .baseAddr           = UART3_BASE,
    .intNum             = INT_UART3,
    .intPriority        = (~0),
    .flowControl        = UARTMSP432E4_FLOWCTRL_NONE,
    .ringBufPtr         = uartMSP432E4RingBuffer3,
    .ringBufSize        = sizeof(uartMSP432E4RingBuffer3),
    .rxPin              = UARTMSP432E4_PA4_U3RX,
    .txPin              = UARTMSP432E4_PA5_U3TX,
    .ctsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .rtsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .errorFxn           = NULL
};

static unsigned char uartMSP432E4RingBuffer4[32];
UARTMSP432E4_Object uartMSP432E4Objects4;

/* Serial4 */
static const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs4 = {
    .baseAddr           = UART4_BASE,
    .intNum             = INT_UART4,
    .intPriority        = (~0),
    .flowControl        = UARTMSP432E4_FLOWCTRL_NONE,
    .ringBufPtr         = uartMSP432E4RingBuffer4,
    .ringBufSize        = sizeof(uartMSP432E4RingBuffer4),
    .rxPin              = UARTMSP432E4_PK0_U4RX,
    .txPin              = UARTMSP432E4_PK1_U4TX,
    .ctsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .rtsPin             = UARTMSP432E4_PIN_UNASSIGNED, 
    .errorFxn           = NULL
};

const UART_Config UART_config[Board_UARTCOUNT] = {
    {   // Serial
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object      = &uartMSP432E4Objects0,
        .hwAttrs     = &uartMSP432E4HWAttrs0
    },
    {   // Serial1
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object      = &uartMSP432E4Objects1,
        .hwAttrs     = &uartMSP432E4HWAttrs1
    },
    {   // Serial2
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object      = &uartMSP432E4Objects2,
        .hwAttrs     = &uartMSP432E4HWAttrs2
    },
    {   // Serial3
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object      = &uartMSP432E4Objects3,
        .hwAttrs     = &uartMSP432E4HWAttrs3
    },
    {   // Serial4
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object      = &uartMSP432E4Objects4,
        .hwAttrs     = &uartMSP432E4HWAttrs4
    },
};

const uint_least8_t UART_count = Board_UARTCOUNT;

